arr = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

# 1. 基础切片 [start:stop]
print(arr[2:8])   # [2, 3, 4, 5, 6, 7]  (索引2到7，不含8)

# 2. 省略start（默认从0开始）
print(arr[:5])    # [0, 1, 2, 3, 4]

# 3. 省略stop（默认到末尾）
print(arr[5:])    # [5, 6, 7, 8, 9]

# 4. 省略start和stop（复制整个列表）
print(arr[:])     # [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

# 5. 超出范围不影响（Python自动处理）
print(arr[2:100]) # [2, 3, 4, 5, 6, 7, 8, 9]  (超出部分忽略)
print(arr[-2:100])# [8, 9] 

arr=[0,1,2,3,4,5,6,7,8,9]

print('1. 基础切片 [start:stop]')
print(arr[2:8]) #[2, 3, 4, 5, 6, 7]

print('2. 省略start（默认从0开始）')
print(arr[:5]) #[0, 1, 2, 3, 4]

print('3. 省略stop（默认到末尾）')
print(arr[5:]) #[5, 6, 7, 8, 9]

print('4. 省略start和stop（复制整个列表）')
print(arr[:]) #[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

print(" 5. 超出范围不影响（Python自动处理）")
print(arr[2:100]) #[2, 3, 4, 5, 6, 7, 8, 9]
print(arr[-2:100]) #[8, 9]
